PKS1C/src/Documents/ДоговорОбслуживания/ДоговорОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорОбслуживания</name>
  <registerRecords>InformationRegister.ДоговораОбслуживания</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Enums/СтатусыДоговоровОбслуживания/СтатусыДоговоровОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговоровОбслуживания</name>
  <enumValues>
    <name>Действующий</name>
  </enumValues>
  <enumValues>
    <name>Недействующий</name>
  </enumValues>
  <enumValues>
    <name>ЧерныйСписок</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/Documents/ДоговорОбслуживания/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ЧерныйСписокПриИзменении(Элемент)
	Если Объект.ЧерныйСписок И (Не ЗначениеЗаполнено(Объект.СрокДействия) ИЛИ Объект.СрокДействия > НачалоДня(ТекущаяДата())) Тогда
		Объект.СрокДействия = НачалоДня(ТекущаяДата() + 3600 * 24); 
	КонецЕсли;
	//УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Если Объект.Проведен Тогда
		Элементы.АктуальныйДоговорНадпись.Видимость = Ложь;
		АктуальныйДоговорНадпись = "Перейти к актуальному";
		
		Если Объект.ЧерныйСписок Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.ЧерныйСписок");
		ИначеЕсли Не ЕстьНовыйДоговор() И (Объект.СрокДействия > НачалоДня(ТекущаяДата()) Или Не ЗначениеЗаполнено(Объект.СрокДействия)) Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Действующий");
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Недействующий");
		КонецЕсли;
		
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровОбслуживания.Действующий") Тогда
			Элементы.Статус.ЦветТекста = WebЦвета.Черный;
		Иначе
			Элементы.Статус.ЦветТекста = WebЦвета.Красный;
			ПоследнийДоговор = ПоследнийДоговор(Объект.Контрагент);
			Если ПоследнийДоговор <> Неопределено И ПоследнийДоговор <> Объект.Ссылка Тогда
				Элементы.АктуальныйДоговорНадпись.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	//УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Функция ЕстьНовыйДоговор()
	Возврат АутсорсРаботы.ЕстьНовыйДоговор(Объект.Контрагент, Объект.Дата);
КонецФункции

&НаСервереБезКонтекста
Функция ПоследнийДоговор(Контрагент)
	Договор = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(, Контрагент = &Контрагент) КАК ДоговораОбслуживанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Договор = ВыборкаДетальныеЗаписи.Регистратор;
	КонецЕсли;
	Возврат Договор;
КонецФункции

&НаКлиенте
Процедура АктуальныйДоговорНадписьНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АктуальныйДоговор = ПоследнийДоговор(Объект.Контрагент);
	Если ЗначениеЗаполнено(АктуальныйДоговор) Тогда
		ОткрытьЗначение(АктуальныйДоговор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры
